Repository: LongDirtyAnimAlf/fpcupdeluxe
Catalog: languages/fpcupdeluxe.*.po
Languages: de, fr, nl, th

source: &OK
th: &ตกลง

source: Confirmation
de: Bestätigung
nl: Bevestiging
th: การยืนยัน

source: Information
nl: Informatie
th: ข้อมูล

source: Extras
th: พิเศษ

# tform1.listboxfpchistorynew.columns[2].caption
source: Date
de: Datum
nl: Datum
th: วันที่

# tform1.listboxlazarushistorynew.columns[2].caption
source: Date
de: Datum
nl: Datum
th: วันที่

source: Modules
de: Module
th: โมดูล

source: OS
th: ระบบปฏิบัติการ (OS)

source: Stable
de: Stabil
th: เสถียร (Stable)

source: Native compiler
de: Nativer Compiler
