Repository: LongDirtyAnimAlf/fpcupdeluxe
Catalog: languages/fpcupdeluxe.*.po
Languages: de, fr, nl, th

source: Add context for FPC and Lazarus files.
de: Kontextmenü für FPC- und Lazarus-Dateien hinzufügen.
fr: Ajouter un contexte pour les fichiers FPC et Lazarus.
nl: Context toevoegen voor FPC- en Lazarus-bestanden.
th: เพิ่มเมนูบริบท (Context menu) สำหรับไฟล์ FPC และ Lazarus

source: Re-apply local changes when updating.
de: Lokale Änderungen beim Aktualisieren erneut anwenden.
fr: Réappliquer les modifications locales lors de la mise à jour.
nl: Lokale wijzigingen opnieuw toepassen bij bijwerken.
th: นำการเปลี่ยนแปลงในเครื่องมาใช้ใหม่เมื่อมีการอัปเดต

source: Always ask for confirmation.
de: Immer um Bestätigung bitten.
fr: Toujours demander une confirmation.
nl: Altijd om bevestiging vragen.
th: ถามเพื่อยืนยันทุกครั้ง

source: Docked Lazarus IDE.
de: Angedockte Lazarus IDE.
fr: IDE Lazarus docké.
nl: Gedockte Lazarus IDE.
th: ใช้ Lazarus IDE แบบรวมหน้าต่าง (Docked)

source: Allow patching of sources by online patches.
de: Quellcode-Anpassung durch Online-Patches zulassen.
fr: Autoriser la correction des sources par des correctifs en ligne.
nl: Patching van bronbestanden via online patches toestaan.
th: อนุญาตให้แก้ไขซอร์สโค้ดด้วยแพตช์ออนไลน์

source: Be extra verbose.
de: Ausführliche Protokollierung aktivieren.
fr: Être plus verbeux.
nl: Extra uitgebreide uitvoer (verbose).
th: แสดงรายละเอียดการทำงานอย่างละเอียด

source: Use local repo-client.
de: Lokalen Repository-Client nutzen.
fr: Utiliser le client du dépôt local.
nl: Gebruik lokale repo-client.
th: ใช้ repo-client ภายในเครื่อง

source: Build dotted RTL.
de: Dotted RTL erstellen.
fr: Construire RTL ponctué.
nl: Bouw dotted RTL.
th: สร้าง RTL แบบ Dotted (Namespaced)

source: Build FPC unicode.
de: FPC Unicode erstellen.
fr: Construire FPC unicode.
nl: Bouw FPC unicode.
th: สร้าง FPC แบบ Unicode

source: Check for fpcupdeluxe updates.
de: Nach fpcupdeluxe-Updates suchen.
fr: Vérifier les mises à jour de fpcupdeluxe.
nl: Controleer op fpcupdeluxe updates.
th: ตรวจสอบการอัปเดตของ fpcupdeluxe

source: Force linking against lowest @GLIBC-version.
de: Linken gegen niedrigste @GLIBC-Version erzwingen.
fr: Forcer la liaison avec la version @GLIBC la plus basse.
nl: Forceer koppeling met de laagste @GLIBC-versie.
th: บังคับให้ลิงก์กับ GLIBC เวอร์ชันต่ำสุด

source: Include Help.
de: Hilfe einschließen.
fr: Inclure l'aide.
nl: Help insluiten.
th: รวมไฟล์ช่วยเหลือ (Help)

source: Include LCL with cross-compiler.
de: LCL in Cross-Compiler einschließen.
fr: Inclure LCL avec le compilateur croisé.
nl: LCL insluiten bij cross-compiler.
th: รวม LCL เข้ากับ Cross-compiler

source: Get package repositories.
de: Paket-Repositorys abrufen.
fr: Obtenir les dépôts de paquets.
nl: Pakket-repositories ophalen.
th: รับคลังแพ็กเกจ (Package repositories)

source: Get FPC/Lazarus repositories.
de: FPC/Lazarus-Repositorys abrufen.
fr: Obtenir les dépôts FPC/Lazarus.
nl: FPC/Lazarus-repositories ophalen.
th: รับคลัง FPC/Lazarus

source: Save settings in fpcup-script.
de: Einstellungen im fpcup-Skript speichern.
fr: Enregistrer les paramètres dans fpcup-script.
nl: Instellingen opslaan in fpcup-script.
th: บันทึกการตั้งค่าลงใน fpcup-script

source: Send location and install info.
de: Standort- und Installationsinfo senden.
fr: Envoyer l'emplacement et les infos d'installation.
nl: Locatie- en installatie-info verzenden.
th: ส่งข้อมูลตำแหน่งที่ตั้งและรายละเอียดการติดตั้ง

source: Split FPC sources and bins.
de: FPC-Quellen und Binärdateien trennen.
fr: Séparer les sources et binaires FPC.
nl: Splits FPC-bronbestanden en binaries.
th: แยกซอร์สโค้ดและไฟล์ไบนารีของ FPC

source: Split Lazarus sources and bins.
de: Lazarus-Quellen und Binärdateien trennen.
fr: Séparer les sources et binaires Lazarus.
nl: Splits Lazarus-bronbestanden en binaries.
th: แยกซอร์สโค้ดและไฟล์ไบนารีของ Lazarus

source: Use system FPC for Lazarus.
de: System-FPC für Lazarus verwenden.
fr: Utiliser le FPC du système pour Lazarus.
nl: Gebruik systeem-FPC voor Lazarus.
th: ใช้ FPC ของระบบเพื่อสร้าง Lazarus

source: FPC/Lazarus/Modules rebuild only.
de: Nur FPC/Lazarus/Module neu erstellen.
fr: Reconstruction uniquement de FPC/Lazarus/Modules.
nl: Alleen FPC/Lazarus/modules herbouwen.
th: สร้าง FPC/Lazarus/Modules ใหม่เท่านั้น

source: Use jobs for GNU make.
de: Jobs für GNU make verwenden.
fr: Utiliser les tâches pour GNU make.
nl: Gebruik jobs voor GNU make.
th: ใช้การทำงานแบบขนาน (Jobs) สำหรับ GNU make

source: Use wget/libcurl as downloader.
de: wget/libcurl als Downloader verwenden.
fr: Utiliser wget/libcurl comme téléchargeur.
nl: Gebruik wget/libcurl als downloader.
th: ใช้ wget/libcurl เป็นตัวดาวน์โหลด

# extrasettings.captionenabledelphirtti
source: Enable Delphi RTTI.
de: Delphi RTTI aktivieren.
fr: Activer Delphi RTTI.
nl: Delphi RTTI inschakelen.
th: เปิดใช้งาน Delphi RTTI

# extrasettings.captionusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
de: Software-Emulation für 80-Bit-Floats aktivieren.
fr: Activer l'émulation logicielle des nombres flottants 80 bits.
nl: Software-emulatie van 80-bit floats inschakelen.
th: เปิดใช้งานการจำลองซอฟต์แวร์สำหรับทศนิยม 80 บิต

source: Double clicking on FPC and Lazarus files will open Lazarus.
de: Doppelklick auf FPC- oder Lazarus-Dateien öffnet Lazarus.
fr: Un double clic sur les fichiers FPC et Lazarus ouvrira Lazarus.
nl: Dubbelklikken op FPC- en Lazarus-bestanden zal Lazarus openen.
th: ดับเบิลคลิกที่ไฟล์ FPC และ Lazarus เพื่อเปิดด้วย Lazarus

source: Fpcupdeluxe can re-apply the local changes automagically by using local auto-patch.
de: Fpcupdeluxe kann lokale Änderungen automatisch per Auto-Patch wiederherstellen.
fr: Fpcupdeluxe peut réappliquer automatiquement les modifications locales à l'aide d'un patch automatique local.
nl: Fpcupdeluxe kan lokale wijzigingen automatisch opnieuw toepassen via lokale auto-patch.
th: Fpcupdeluxe สามารถนำการเปลี่ยนแปลงในเครื่องมาใช้ใหม่โดยอัตโนมัติด้วยระบบ auto-patch ในเครื่อง

source: Show a confirmation dialog with yes/no before every build.
de: Vor jedem Build einen Bestätigungsdialog (Ja/Nein) anzeigen.
fr: Afficher une boîte de dialogue de confirmation avec oui/non avant chaque compilation.
nl: Toon een bevestigingsvenster met ja/nee voor elke bouw.
th: แสดงกล่องยืนยัน ใช่/ไม่ใช่ ก่อนการ Build ทุกครั้ง

source: Build a docked Lazarus IDE
de: Eine angedockte Lazarus IDE erstellen
fr: Construire un IDE Lazarus docké
nl: Bouw een gedockte Lazarus IDE
th: สร้าง Lazarus IDE แบบรวมหน้าต่าง (Docked)

source: Fpcupdeluxe can patch the sources automagically by using online patches.
de: Fpcupdeluxe kann Quellen automatisch mittels Online-Patches anpassen.
fr: Fpcupdeluxe peut corriger les sources automatiquement à l'aide de correctifs en ligne.
nl: Fpcupdeluxe kan bronbestanden automatisch patchen via online patches.
th: Fpcupdeluxe สามารถแพตช์ซอร์สโค้ดโดยอัตโนมัติโดยใช้แพตช์ออนไลน์

source: Use the repo-client by fpcupdeluxe.
de: Den von fpcupdeluxe bereitgestellten Repository-Client nutzen.
fr: Utiliser le dépôt client par fpcupdeluxe.
nl: Gebruik de repo-client van fpcupdeluxe.
th: ใช้ repo-client โดย fpcupdeluxe

source: FPC has support for creating a "dotted RTL". This is a set of units from RTL/Packages where all unit names are namespaced (dotted).
de: FPC unterstützt die Erstellung einer "dotted RTL". Dies ist ein Satz von Units aus RTL/Packages, bei denen alle Unit-Namen mit Namensräumen (dotted) versehen sind.
fr: FPC prend en charge la création d'un "RTL pointé". Il s'agit d'un ensemble d'unités provenant de RTL/Packages où tous les noms d'unités sont nommés (pointés).
nl: FPC ondersteunt het maken van een "dotted RTL". Dit is een set units uit RTL/Packages waarbij alle unit-namen een namespace (met punten) hebben.
th: FPC รองรับการสร้าง "dotted RTL" ซึ่งเป็นชุดยูนิตจาก RTL/Packages ที่ชื่อยูนิตทั้งหมดถูกกำหนด Namespace (แบบมีจุด)

source: Build FPC unicode for better Delphi compatibility.
de: FPC Unicode für bessere Delphi-Kompatibilität erstellen.
fr: Construire FPC unicode pour une meilleure compatibilité avec Delphi.
nl: Bouw FPC unicode voor betere Delphi-compatibiliteit.
th: สร้าง FPC unicode เพื่อการทำงานร่วมกับ Delphi ที่ดีขึ้น

source: Check for updates of fpcupdeluxe binaries.
de: Nach Updates für die fpcupdeluxe Programmdateien suchen.
fr: Vérifier les mises à jour des binaires fpcupdeluxe.
nl: Controleer op updates voor fpcupdeluxe binaries.
th: ตรวจสอบการอัปเดตของไบนารี fpcupdeluxe

source: Force linking against lowest possible GLIBC version to (possibly) increase the compatibility with older Linux versions. Use at your own risk.
de: Linken gegen niedrigstmögliche GLIBC-Version erzwingen, um (möglicherweise) die Kompatibilität mit älteren Linux-Versionen zu erhöhen. Verwendung auf eigene Gefahr.
fr: Forcer la liaison avec la version GLIBC la plus basse possible afin d'augmenter (éventuellement) la compatibilité avec les anciennes versions de Linux. À utiliser à vos propres risques.
nl: Forceer koppeling met de laagst mogelijke GLIBC-versie om (mogelijk) de compatibiliteit met oudere Linux-versies te verhogen. Gebruik op eigen risico.
th: บังคับให้ลิงก์กับ GLIBC เวอร์ชันต่ำที่สุดเท่าที่จะเป็นไปได้ เพื่อเพิ่มความเข้ากันได้กับ Linux เวอร์ชันเก่า (โปรดใช้งานด้วยความเสี่ยงของท่านเอง)

source: Download whole repository, or only latest files.
de: Ganzes Repository oder nur die neuesten Dateien herunterladen.
fr: Télécharger l'intégralité du référentiel ou uniquement les fichiers les plus récents.
nl: Download de volledige repository, of alleen de nieuwste bestanden.
th: ดาวน์โหลดคลังทั้งหมด หรือเฉพาะไฟล์ล่าสุด

source: Save the current install-settings in a fpclazup-script for later use.
de: Die aktuellen Installations-Einstellungen in einem fpclazup-Skript für spätere Verwendung speichern.
fr: Enregistrer les paramètres d'installation actuels dans un script fpclazup pour une utilisation ultérieure.
nl: Sla de huidige installatie-instellingen op in een fpclazup-script voor later gebruik.
th: บันทึกการตั้งค่าการติดตั้งปัจจุบันลงใน fpclazup-script เพื่อใช้ในภายหลัง

source: Location and install info will be send to public central fpcupdeluxe server.
de: Standort- und Installationsinfo werden an den öffentlichen zentralen fpcupdeluxe-Server gesendet.
fr: Les infos de localisation et d'installation seront envoyées au serveur central public fpcupdeluxe.
nl: Locatie- en installatie-info wordt verzonden naar de publieke centrale fpcupdeluxe server.
th: ข้อมูลตำแหน่งและรายละเอียดการติดตั้งจะถูกส่งไปยังเซิร์ฟเวอร์ส่วนกลางของ fpcupdeluxe

source: Use the system wide install of FPC to build Lazarus.
de: Die systemweite FPC-Installation zum Erstellen von Lazarus nutzen.
fr: Utiliser l'installation système de FPC pour compiler Lazarus.
nl: Gebruik de systeem-installatie van FPC om Lazarus te bouwen.
th: ใช้ FPC ที่ติดตั้งในระบบเพื่อสร้าง Lazarus

# extrasettings.hintenabledelphirtti
source: Enable Delphi RTTI.
de: Delphi RTTI aktivieren.
fr: Activer Delphi RTTI.
nl: Delphi RTTI inschakelen.
th: เปิดใช้งาน Delphi RTTI

# extrasettings.hintusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
de: Software-Emulation für 80-Bit-Floats aktivieren.
fr: Activer l'émulation logicielle des nombres flottants 80 bits.
nl: Software-emulatie van 80-bit floats inschakelen.
th: เปิดใช้งานการจำลองซอฟต์แวร์สำหรับทศนิยม 80 บิต

source: Abort
de: Abbrechen
fr: Abandonner
nl: Afbreken
th: ยกเลิก

source: &All
de: &Alle
fr: Tout
nl: &Alles
th: &ทั้งหมด

source: Cancel
de: Abbrechen
fr: Annuler
nl: Annuleren
th: ยกเลิก

source: &Close
de: &Schließen
fr: Fermer
nl: &Sluiten
th: &ปิด

source: &Help
de: &Hilfe
fr: Aide
th: &ช่วยเหลือ

source: &Ignore
de: &Ignorieren
fr: &Ignorer
nl: &Negeren
th: &ละเว้น

source: &No
de: &Nein
fr: &Non
nl: &Nee
th: &ไม่

source: No to all
de: Nein zu allen
fr: Non à tout
nl: Nee op alles
th: ไม่ทั้งหมด

source: &Open
de: &Öffnen
fr: &Ouvrir
nl: &Openen
th: &เปิด

source: &Retry
de: &Wiederholen
fr: &Réessayer
nl: &Opnieuw
th: &ลองใหม่

source: &Save
de: &Speichern
fr: Enregi&strer
nl: &Opslaan
th: &บันทึก

source: &Unlock
de: &Entsperren
fr: Déverrouiller
nl: &Ontgrendelen
th: &ปลดล็อก

source: &Yes
de: &Ja
fr: Oui
nl: &Ja
th: &ใช่

source: Yes to &All
de: Ja zu &allen
fr: Oui à tout
nl: Ja op &alles
th: ใช่ทั้ง&หมด

source: Authentication
de: Authentifizierung
fr: Authentification
nl: Authenticatie
th: การยืนยันตัวตน

source: Custom
de: Benutzerdefiniert
fr: Personnalisé
nl: Aangepast
th: กำหนดเอง

source: Error
de: Fehler
fr: Erreur
nl: Fout
th: ข้อผิดพลาด

source: Warning
de: Warnung
fr: Avertissement
nl: Waarschuwing
th: คำเตือน

source: FPCUPdeluxe can try to download them if available !
de: FPCUPdeluxe kann versuchen, diese herunterzuladen, falls verfügbar!
fr: FPCUPdeluxe peut essayer de les télécharger s'ils sont disponibles !
nl: FPCUPdeluxe kan proberen deze te downloaden indien beschikbaar!
th: FPCUPdeluxe สามารถพยายามดาวน์โหลดไฟล์เหล่านี้ได้หากมีให้ใช้งาน !

source: Going to auto-build all installed cross-compilers !
de: Alle installierten Cross-Compiler werden automatisch erstellt!
fr: Compilation auto de tous les compilateurs croisés installés !
nl: Gaat alle geïnstalleerde cross-compilers automatisch bouwen!
th: กำลังจะสร้าง (Auto-build) Cross-compilers ทั้งหมดที่ติดตั้งไว้ !

source: Checking FPC configfile [fpc.cfg] for cross-compilers in
de: Prüfe FPC-Konfigurationsdatei [fpc.cfg] auf Cross-Compiler in
fr: Vérification du fichier de configuration de FPC [fpc.cfg] pour les compilateurs croisés en
nl: Controleren van FPC-configuratiebestand [fpc.cfg] op cross-compilers in
th: กำลังตรวจสอบไฟล์คอนฟิก FPC [fpc.cfg] สำหรับ Cross-compilers ใน

source: Found crosscompiler for
de: Cross-Compiler gefunden für
fr: Compilateur croisé trouvé pour
nl: Cross-compiler gevonden voor
th: พบ Crosscompiler สำหรับ

source: Going to update cross-compiler.
de: Cross-Compiler wird aktualisiert.
fr: Mise à jour du compilateur croisé.
nl: Gaat cross-compiler bijwerken.
th: กำลังจะอัปเดต Cross-compiler

source: Going to install a cross-compiler from available sources.
de: Cross-Compiler wird aus verfügbaren Quellen installiert.
fr: Installer un compilateur croisé à partir des sources disponibles.
nl: Gaat een cross-compiler installeren vanuit beschikbare bronbestanden.
th: กำลังจะติดตั้ง Cross-compiler จากซอร์สที่มีอยู่

source: Going to build the native compiler for
de: Erstelle nativen Compiler für
fr: Construire le compilateur natif pour
nl: Gaat de native compiler bouwen voor
th: กำลังจะสร้าง Native compiler สำหรับ

source: Please wait. Checking for updates.
de: Bitte warten. Suche nach Updates.
fr: Veuillez patienter. Vérification des mises à jour.
nl: Even geduld a.u.b. Controleren op updates.
th: กรุณารอสักครู่ กำลังตรวจสอบการอัปเดต

source: Attention ! Fpcupdeluxe is able to log some install info. (Country, OS, Versions, Up-Actions) This data is send towards a mORMot server, where it is made available to anybody. (see URL shown in screen and statusbar) Do you allow this logging info to be gathered ?
de: Achtung ! Fpcupdeluxe kann einige Installationsinfos protokollieren. (Land, OS, Versionen, Up-Aktionen) Diese Daten werden an einen mORMot-Server gesendet, wo sie für jeden zugänglich sind. (siehe URL auf dem Bildschirm und in der Statusleiste) Erlauben Sie die Erfassung dieser Protokollinformationen?
fr: Attention ! Fpcupdeluxe est capable d'enregistrer certaines informations d'installation. (Pays, OS, versions, actions de mise à jour) Ces données sont envoyées vers un serveur mORMot, où elles sont mises à la disposition de tous. (voir l'URL affichée à l'écran et dans la barre d'état) Autorisez-vous la collecte de ces informations ?
nl: Let op! Fpcupdeluxe kan installatie-informatie loggen. (Land, OS, Versies, Up-acties) Deze gegevens worden naar een mORMot-server gestuurd, waar ze voor iedereen beschikbaar zijn. (zie URL getoond in het scherm en de statusbalk) Staat u toe dat deze loggegevens verzameld worden?
th: โปรดทราบ ! Fpcupdeluxe สามารถบันทึกข้อมูลการติดตั้งบางส่วนได้ (ประเทศ, ระบบปฏิบัติการ, เวอร์ชัน, การดำเนินการ) ข้อมูลนี้จะถูกส่งไปยังเซิร์ฟเวอร์ mORMot ซึ่งเปิดเผยข้อมูลต่อสาธารณะ (ดู URL ที่แสดงบนหน้าจอและแถบสถานะ) คุณอนุญาตให้รวบรวมข้อมูลบันทึกนี้หรือไม่ ?

source: FPCUPdeluxe cannot be run inside the Downloads folder.
de: FPCUPdeluxe kann nicht im Downloads-Ordner ausgeführt werden.
fr: FPCUPdeluxe ne peut pas être exécuté dans le dossier Téléchargements.
nl: FPCUPdeluxe kan niet worden uitgevoerd in de map Downloads.
th: FPCUPdeluxe ไม่สามารถเรียกทำงานภายในโฟลเดอร์ Downloads ได้

source: This is NOT allowed by OSX security measures.
de: Dies ist aufgrund von macOS Sicherheitsmaßnahmen NICHT erlaubt.
fr: Ceci n'est PAS autorisé par les mesures de sécurité d'OSX.
nl: Dit is NIET toegestaan door OSX-beveiligingsmaatregelen.
th: สิ่งนี้ไม่ได้รับอนุญาตตามมาตรการความปลอดภัยของ OSX

source: Copy FPCUPdeluxe into its own directory and run from there.
de: Kopieren Sie FPCUPdeluxe in ein eigenes Verzeichnis und starten Sie es von dort.
fr: Copier FPCUPdeluxe dans son propre répertoire et l'exécuter à partir de là.
nl: Kopieer FPCUPdeluxe naar een eigen map en voer het van daaruit uit.
th: โปรดคัดลอก FPCUPdeluxe ไปยังไดเรกทอรีเฉพาะและเรียกใช้งานจากที่นั่น

source: FPCUPdeluxe could not create its necessary setting-files.
de: FPCUPdeluxe konnte die notwendigen Einstellungsdateien nicht erstellen.
fr: FPCUPdeluxe n'a pas pu créer ses fichiers de configuration nécessaires.
nl: FPCUPdeluxe kon de benodigde instellingenbestanden niet aanmaken.
th: FPCUPdeluxe ไม่สามารถสร้างไฟล์การตั้งค่าที่จำเป็นได้

source: Please check the folder permissions, and re-start.
de: Bitte prüfen Sie die Ordnerberechtigungen und starten Sie neu.
fr: Veuillez vérifier les permissions du dossier, et redémarrer.
nl: Controleer de maprechten en start opnieuw op.
th: โปรดตรวจสอบสิทธิ์ของโฟลเดอร์ (Permissions) และเริ่มโปรแกรมใหม่

source: No GIT executable found on system. Tag-list cannot be received.
de: Keine GIT-Programmdatei auf dem System gefunden. Tag-Liste kann nicht empfangen werden.
fr: Aucun exécutable GIT trouvé sur le système. Impossible de recevoir la liste des tags.
nl: Geen GIT-uitvoerbaar bestand gevonden op het systeem. Tag-lijst kan niet worden opgehaald.
th: ไม่พบไฟล์โปรแกรม GIT ในระบบ ไม่สามารถรับรายการ Tag ได้

source: Going to install %s and %s%s.
de: Installiere %s und %s%s.
fr: Installation de %s et %s%s.
nl: Gaat %s en %s%s installeren.
th: กำลังจะติดตั้ง %s และ %s%s

source: Going to install the %s.
de: Installiere %s.
fr: Installation de %s.
nl: Gaat de %s installeren.
th: กำลังจะติดตั้ง %s

source: Going to install the cross-compiler for
de: Installiere Cross-Compiler für
fr: Installation du compilateur croisé pour
nl: Gaat de cross-compiler installeren voor
th: กำลังจะติดตั้ง Cross-compiler สำหรับ

source: Install directory
de: Installationsverzeichnis
fr: Répertoire d'installation
nl: Installatiemap
th: ไดเรกทอรีติดตั้ง

source: Current install directory
de: Aktuelles Installationsverzeichnis
fr: Répertoire d'installation actuel
nl: Huidige installatiemap
th: ไดเรกทอรีติดตั้งปัจจุบัน

source: Going to install/update FPC only.
de: Nur FPC wird installiert/aktualisiert.
fr: Installation/mise à jour de FPC uniquement.
nl: Gaat alleen FPC installeren/bijwerken.
th: กำลังจะติดตั้ง/อัปเดต FPC เท่านั้น

source: Going to install/update FPC and Lazarus.
de: FPC und Lazarus werden installiert/aktualisiert.
fr: Installation/mise à jour de FPC et Lazarus.
nl: Gaat FPC en Lazarus installeren/bijwerken.
th: กำลังจะติดตั้ง/อัปเดต FPC และ Lazarus

source: Going to install/update Lazarus only.
de: Nur Lazarus wird installiert/aktualisiert.
fr: Installation/mise à jour de Lazarus uniquement.
nl: Gaat alleen Lazarus installeren/bijwerken.
th: กำลังจะติดตั้ง/อัปเดต Lazarus เท่านั้น

source: Going to install/update module
de: Modul wird installiert/aktualisiert
fr: Installation/mise à jour du module
nl: Gaat module installeren/bijwerken
th: กำลังจะติดตั้ง/อัปเดตโมดูล

source: Got settings from install directory
de: Einstellungen aus dem Installationsverzeichnis geladen
fr: Paramètres récupérés depuis le répertoire d'installation
nl: Instellingen opgehaald uit installatiemap
th: ได้รับค่าการตั้งค่าจากไดเรกทอรีติดตั้ง

source: Looking for
de: Suche nach
fr: À la recherche de
nl: Zoeken naar
th: กำลังค้นหา

source: Going to look for the right cross-bins. Can (will) take some time !
de: Suche nach passenden Cross-Binaries. Dies kann etwas dauern!
fr: Recherche des binaires croisés corrects. Cela peut (va) prendre un certain temps !
nl: Gaat zoeken naar de juiste cross-binaries. Dit kan even duren!
th: กำลังค้นหาไฟล์ cross-bins ที่ถูกต้อง อาจใช้เวลาสักครู่ !

source: Going to look for the right cross-libraries. Can (will) take some time !
de: Suche nach passenden Cross-Bibliotheken. Dies kann etwas dauern!
fr: Recherche des bibliothèques croisées correctes. Cela peut (va) prendre un certain temps !
nl: Gaat zoeken naar de juiste cross-libraries. Dit kan even duren!
th: กำลังค้นหาไฟล์ cross-libraries ที่ถูกต้อง อาจใช้เวลาสักครู่ !

source: Looking for FPCUPdeluxe cross-tools on GitHub (if any).
de: Suche nach FPCUPdeluxe Cross-Tools auf GitHub (falls vorhanden).
fr: Recherche d'outils croisés FPCUPdeluxe sur GitHub (si existants)
nl: Zoeken naar FPCUPdeluxe cross-tools op GitHub (indien aanwezig).
th: กำลังค้นหาเครื่องมือ Cross-tools ของ FPCUPdeluxe บน GitHub (หากมี)

source: The building of a crosscompiler failed due to missing cross-tools.
de: Erstellung des Cross-Compilers fehlgeschlagen (Cross-Tools fehlen).
fr: La compilation du compilateur croisé a échoué en raison de l'absence d'outils croisés.
nl: Het bouwen van een cross-compiler is mislukt vanwege ontbrekende cross-tools.
th: การสร้าง Crosscompiler ล้มเหลวเนื่องจากขาดเครื่องมือ Cross-tools

source: No valid FPC install found. Please install FPC first.
de: Keine gültige FPC-Installation gefunden. Bitte installieren Sie zuerst FPC.
fr: Aucune installation FPC valide trouvée. Veuillez d'abord installer FPC.
nl: Geen FPC installatie gevonden. Installeer FPC eerst.
th: ไม่พบการติดตั้ง FPC ที่ใช้งานได้ โปรดติดตั้ง FPC ก่อน

source: with given options.
de: mit den angegebenen Optionen.
fr: avec les options fournies.
nl: met opgegeven opties.
th: พร้อมตัวเลือกที่กำหนด

source: Do you want to continue ?
de: Möchten Sie fortfahren?
fr: Voulez-vous continuer ?
nl: Wilt u doorgaan?
th: คุณต้องการดำเนินการต่อหรือไม่ ?

source: Please quit FPCUPdeluxe.
de: Bitte beenden Sie FPCUPdeluxe.
fr: Veuillez quitter FPCUPdeluxe.
nl: Sluit FPCUPdeluxe a.u.b. af.
th: กรุณาออกจากโปรแกรม FPCUPdeluxe

source: Going to remove the cross-compiler for
de: Entferne Cross-Compiler für
fr: Suppression du compilateur croisé pour
nl: Gaat de cross-compiler verwijderen voor
th: กำลังจะลบ Cross-compiler สำหรับ

source: Going to remove module
de: Entferne Modul
fr: Suppression du module
nl: Gaat module verwijderen
th: กำลังจะลบโมดูล

source: Please select a CPU target first.
de: Bitte wählen Sie zuerst ein CPU-Ziel aus.
fr: Veuillez d'abord sélectionner une cible CPU.
nl: Selecteer eerst een doel-CPU.
th: กรุณาเลือกสถาปัตยกรรม CPU (Target CPU) ก่อน

source: Please select a FPC and Lazarus target first
de: Bitte wählen Sie zuerst ein FPC- und Lazarus-Ziel aus
fr: Veuillez d'abord sélectionner une cible FPC et Lazarus
nl: Selecteer eerst een FPC- en Lazarus-doel
th: กรุณาเลือกเป้าหมาย FPC และ Lazarus ก่อน

source: Please select a FPC target first
de: Bitte wählen Sie zuerst ein FPC-Ziel aus
fr: Veuillez d'abord sélectionner une cible FPC
nl: Selecteer eerst een FPC-doel
th: กรุณาเลือกเป้าหมาย FPC ก่อน

source: Please select a Lazarus target first
de: Bitte wählen Sie zuerst ein Lazarus-Ziel aus
fr: Veuillez d'abord sélectionner une cible Lazarus
nl: Selecteer eerst een Lazarus-doel
th: กรุณาเลือกเป้าหมาย Lazarus ก่อน
