Repository: LongDirtyAnimAlf/fpcupdeluxe
Catalog: languages/fpcupdeluxe.*.po
Languages: de, fr, nl, th

source: Please select an OS target first.
de: Bitte wählen Sie zuerst ein OS-Ziel aus.
fr: Veuillez d'abord sélectionner un OS cible.
nl: Selecteer eerst een doel-besturingssysteem (OS).
th: กรุณาเลือกระบบปฏิบัติการ (Target OS) ก่อน

source: Having a space in your install path is very ill-advised !
de: Leerzeichen im Installationspfad sind absolut nicht ratsam!
fr: Il est fortement déconseillé d'avoir un espace dans votre chemin d'installation !
nl: Spaties in het installatiepad worden ten zeerste afgeraden!
th: ไม่แนะนำอย่างยิ่งให้มีช่องว่าง (Space) ในเส้นทางติดตั้ง !

source: Trying to build the cross-compiler for
de: Versuche Cross-Compiler zu erstellen für
fr: Tentative de création du compilateur croisé pour
nl: Proberen de cross-compiler te bouwen voor
th: กำลังพยายามสร้าง Cross-compiler สำหรับ

source: Going to update all crosscompilers
de: Alle Cross-Compiler werden aktualisiert
fr: Mise à jour de tous les compilateurs croisés
nl: Gaat alle cross-compilers bijwerken
th: กำลังจะอัปเดต Crosscompilers ทั้งหมด

source: New FPCUPdeluxe version available
de: Neue FPCUPdeluxe-Version verfügbar
fr: Nouvelle version de FPCUPdeluxe disponible
nl: Nieuwe FPCUPdeluxe versie beschikbaar
th: มี FPCUPdeluxe เวอร์ชันใหม่ให้อัปเดต

source: No updates found.
de: Keine Updates gefunden.
fr: Aucune mise à jour trouvée.
nl: Geen updates gevonden.
th: ไม่พบการอัปเดต

source: E&xit
de: &Beenden
fr: &Quitter
nl: &Afsluiten
th: ออ&ก

source: Exit
de: Beenden
fr: Quitter
nl: Afsluiten
th: ออกจากโปรแกรม

source: &Save log
de: &Protokoll speichern
fr: Enregi&strer les log
nl: Log op&slaan
th: &บันทึก Log

source: Save As
de: Speichern unter
fr: Enregistrer sous
nl: Opslaan als
th: บันทึกเป็น

source: Will install/update FPC and Lazarus stable and LAMW
de: Installiert/aktualisiert FPC und Lazarus Stable sowie LAMW
fr: Installera/mettra à jour FPC et Lazarus stable et LAMW
nl: Zal stabiele FPC en Lazarus en LAMW installeren/bijwerken
th: จะติดตั้ง/อัปเดต FPC และ Lazarus เวอร์ชันเสถียร รวมถึง LAMW

source: Basic
de: Basis
fr: Base
nl: Basis
th: พื้นฐาน

source: Install/update FPC+Lazarus
de: Installiere/Aktualisiere FPC+Lazarus
fr: Installer/mettre à jour FPC+Lazarus
nl: Installeren/bijwerken FPC+Lazarus
th: ติดตั้ง/อัปเดต FPC+Lazarus

source: Will install/update the selected version of both FPC and Lazarus.
de: Installiert/aktualisiert die gewählten Versionen von FPC und Lazarus.
fr: Installera/mettra à jour la version sélectionnée de FPC et Lazarus.
nl: Zal de geselecteerde versie van zowel FPC als Lazarus installeren/bijwerken.
th: จะติดตั้งหรืออัปเดต FPC และ Lazarus ตามเวอร์ชันที่เลือก

source: Only FPC
de: Nur FPC
fr: Seulement FPC
nl: Alleen FPC
th: เฉพาะ FPC

source: Only install/update selected FPC version.
de: Nur die gewählte FPC-Version installieren/aktualisieren.
fr: Installer/mettrez à jour uniquement la version sélectionnée du FPC.
nl: Alleen geselecteerde FPC-versie installeren/bijwerken.
th: ติดตั้ง/อัปเดตเฉพาะเวอร์ชัน FPC ที่เลือก

# tform1.bitbtnfpconlytag.caption
source: Add Tag
de: Tag hinzufügen
fr: Ajouter un tag
nl: Tag toevoegen
th: เพิ่ม Tag

source: Add tag/url into FPC install list
de: Tag/URL zur FPC-Installationsliste hinzufügen
fr: Ajouter un tag/url à la liste d'installation FPC
nl: Tag/url toevoegen aan FPC installatielijst
th: เพิ่ม Tag หรือ URL ลงในรายการติดตั้ง FPC

source: Set FPC hash in Setup+
de: FPC-Hash in Setup+ setzen
fr: Définir le hachage FPC dans Configuration+
nl: FPC-hash instellen in Setup+
th: ตั้งค่า FPC Hash ใน Setup+

source: Set FPC revision
de: FPC-Revision setzen
fr: Définir la révision de FPC
nl: FPC-revisie instellen
th: ตั้งค่า FPC Revision

source: STOP
de: STOPP
fr: ARRÊTER
th: หยุด

source: Try to stop current install process
de: Versuchen, den aktuellen Installationsprozess zu stoppen
fr: Tenter d'arrêter le processus d'installation en cours
nl: Huidige installatieproces proberen te stoppen
th: พยายามหยุดกระบวนการติดตั้งปัจจุบัน

source: Only Lazarus
de: Nur Lazarus
fr: Seulement Lazarus
nl: Alleen Lazarus
th: เฉพาะ Lazarus

source: Only install/update selected Lazarus version.
de: Nur die gewählte Lazarus-Version installieren/aktualisieren.
fr: Installer/mettre à jour seulement la version sélectionnée de Lazarus.
nl: Alleen geselecteerde Lazarus-versie installeren/bijwerken.
th: ติดตั้ง/อัปเดตเฉพาะเวอร์ชัน Lazarus ที่เลือก

# tform1.bitbtnlazarusonlytag.caption
source: Add Tag
de: Tag hinzufügen
fr: Ajouter un tag
nl: Tag toevoegen
th: เพิ่ม Tag

source: Add tag/url into Lazarus install list
de: Tag/URL zur Lazarus-Installationsliste hinzufügen
fr: Ajouter un tag/url à la liste d'installation de Lazarus
nl: Tag/url toevoegen aan Lazarus installatielijst
th: เพิ่ม Tag หรือ URL ลงในรายการติดตั้ง Lazarus

source: Set Lazarus hash in Setup+
de: Lazarus-Hash in Setup+ setzen
fr: Définir le hachage Lazarus dans Configuration+
nl: Lazarus-hash instellen in Setup+
th: ตั้งค่า Lazarus Hash ใน Setup+

source: Set Lazarus revision
de: Lazarus-Revision setzen
fr: Définir la révision de Lazarus
nl: Lazarus-revisie instellen
th: ตั้งค่า Lazarus Revision

source: Build Help
de: Hilfe erstellen
fr: Construire l'aide
nl: Help bouwen
th: สร้างไฟล์ช่วยเหลือ

source: Check Tools Location
de: Werkzeug-Pfade prüfen
fr: Vérifier l'emplacement des outils
nl: Locatie tools controleren
th: ตรวจสอบตำแหน่งเครื่องมือ

source: Clear log
de: Protokoll löschen
fr: Effacer le journal
nl: Log wissen
th: ล้างบันทึก (Log)

source: Create Lazarus Configuration
de: Lazarus-Konfiguration erstellen
fr: Créer la configuration Lazarus
nl: Lazarus-configuratie aanmaken
th: สร้างการตั้งค่า Lazarus

# tform1.btngetfpccandidates.caption
source: Get candidates
de: Kandidaten abrufen
fr: Obtenir des candidats
nl: Candidates ophalen
th: รับเวอร์ชัน Candidate

# tform1.btngetfpcfixes.caption
source: Get fixes
de: Fixes abrufen
fr: Obtenir des correctifs
nl: Fixes ophalen
th: รับเวอร์ชัน Fixes

# tform1.btngetfpcreleases.caption
source: Get releases
de: Releases abrufen
fr: Obtenir les versions
nl: Releases ophalen
th: รับเวอร์ชัน Releases

# tform1.btngetlazaruscandidates.caption
source: Get candidates
de: Kandidaten abrufen
fr: Obtenir des candidats
nl: Candidates ophalen
th: รับเวอร์ชัน Candidate

# tform1.btngetlazarusfixes.caption
source: Get fixes
de: Fixes abrufen
fr: Obtenir des correctifs
nl: Fixes ophalen
th: รับเวอร์ชัน Fixes

# tform1.btngetlazarusreleases.caption
source: Get releases
de: Releases abrufen
fr: Obtenir les versions
nl: Releases ophalen
th: รับเวอร์ชัน Releases

source: Get OpenSSL by Browser
de: OpenSSL über Browser abrufen
fr: Obtenir OpenSSL via le navigateur
nl: OpenSSL via browser ophalen
th: รับ OpenSSL ผ่านบราวเซอร์

source: Set install path
de: Installationspfad setzen
fr: Définir le chemin d'installation
nl: Installatiepad instellen
th: ตั้งค่าเส้นทางติดตั้ง

source: Install module
de: Modul installieren
fr: Installer le module
nl: Module installeren
th: ติดตั้งโมดูล

source: Install the selected module.
de: Das gewählte Modul installieren.
fr: Installez le module sélectionné.
nl: De geselecteerde module installeren.
th: ติดตั้งโมดูลที่เลือก

source: Email log
de: Protokoll per E-Mail senden
fr: Envoyer le journal
nl: Log e-mailen
th: ส่ง Log ทางอีเมล

source: Send email to fpcup maintainer containing Commandscreen output.
de: E-Mail mit der Konsolenausgabe an den fpcup-Entwickler senden.
fr: Envoyer un e-mail au responsable de fpcup contenant la sortie de l'écran de commande.
nl: E-mail verzenden naar fpcupbeheerder met uitvoer van het commandoscherm.
th: ส่งอีเมลถึงผู้ดูแล fpcup พร้อมข้อมูลจากหน้าจอคำสั่ง

source: Setup+
fr: Configuration+
th: ตั้งค่าเพิ่มเติม (Setup+)

source: Open the extended settings form.
de: Das Formular für erweiterte Einstellungen öffnen.
fr: Ouvrir le formulaire des paramètres avancés.
nl: Open het uitgebreide instellingenvenster.
th: เปิดหน้าต่างการตั้งค่าเพิ่มเติม

source: Uninstall module
de: Modul deinstallieren
fr: Désinstaller le module
nl: Module verwijderen
th: ถอนการติดตั้งโมดูล

source: Uninstall the selected module.
de: Das gewählte Modul deinstallieren.
fr: Désinstaller le module sélectionné.
nl: De geselecteerde module verwijderen.
th: ถอนการติดตั้งโมดูลที่เลือก

source: Update Lazarus Makefiles
de: Lazarus Makefiles aktualisieren
fr: Mettre à jour les Makefiles de Lazarus
nl: Lazarus-makefiles bijwerken
th: อัปเดต Lazarus Makefiles

source: Update all
de: Alle aktualisieren
fr: Tout mettre à jour
nl: Alles bijwerken
th: อัปเดตทั้งหมด

source: Auto-update all installed cross-compilers.
de: Alle installierten Cross-Compiler automatisch aktualisieren.
fr: Mettre à jour automatiquement tous les compilateurs croisés installés.
nl: Alle geïnstalleerde cross-compilers automatisch bijwerken.
th: อัปเดต Cross-compilers ทั้งหมดที่ติดตั้งไว้โดยอัตโนมัติ

source: Build native compiler
fr: Construire le compilateur natif

source: Build the selected CPU-OS native compiler.
de: Den nativen Compiler für das gewählte CPU-OS-Ziel erstellen.
fr: Construire le compilateur natif du CPU-OS sélectionné.
nl: De geselecteerde CPU-OS native compiler bouwen.
th: สร้าง Native compiler สำหรับ CPU-OS ที่เลือก

source: Install compiler
de: Compiler installieren
fr: Installer le compilateur
nl: Compiler installeren
th: ติดตั้ง Compiler

source: Install the selected CPU-OS cross-compiler.
de: Den gewählten CPU-OS Cross-Compiler installieren.
fr: Installer le compilateur croisé du CPU-OS sélectionné.
nl: De geselecteerde CPU-OS cross-compiler installeren.
th: ติดตั้ง Cross-compiler สำหรับ CPU-OS ที่เลือก

source: Remove compiler
de: Compiler entfernen
fr: Supprimer le compilateur
nl: Compiler verwijderen
th: ลบ Compiler

source: Remove the selected CPU-OS cross-compiler.
de: Den gewählten CPU-OS Cross-Compiler entfernen.
fr: Supprimer le compilateur croisé du CPU-OS sélectionné.
nl: De geselecteerde CPU-OS cross-compiler verwijderen.
th: ลบ Cross-compiler สำหรับ CPU-OS ที่เลือก

source: Set subarch
de: Subarch setzen
fr: Définir la sous-architecture
nl: Subarch instellen
th: ตั้งค่า Subarch

source: Select a subarch for embedded target.
de: Eine Sub-Architektur für eingebettete Ziele wählen.
fr: Sélectionner une sous-architecture pour la cible intégrée.
nl: Selecteer een subarch voor embedded doelen.
th: เลือก Subarch สำหรับเป้าหมายฝังตัว (Embedded)

source: Auto clear
de: Automatisch löschen
fr: Effacement auto
nl: Auto wissen
th: ล้างอัตโนมัติ

source: Check Makefile FPC
de: FPC Makefile prüfen
fr: Vérifier le Makefile FPC
nl: Controleer Makefile FPC
th: ตรวจสอบ Makefile FPC

source: Check Makefile Lazarus
de: Lazarus Makefile prüfen
fr: Vérifier le Makefile Lazarus
nl: Controleer Makefile Lazarus
th: ตรวจสอบ Makefile Lazarus

source: Re-create startup scripts
de: Start-Skripte neu erstellen
fr: Recréer les scripts de démarrage
nl: Opstartscripts opnieuw aanmaken
th: สร้างสคริปต์เริ่มทำงานใหม่

source: Cross
fr: Croisé

source: Will change Lazarus into a single form docked editor.
de: Ändert Lazarus in einen angedockten Ein-Fenster-Editor.
fr: Transformera Lazarus en un éditeur unique en mode docké.
nl: Zal Lazarus veranderen in een editor met één gedockt venster.
th: จะเปลี่ยน Lazarus ให้เป็นตัวแก้ไขแบบรวมหน้าต่างเดียว (Docked)

source: Donate
de: Spenden
fr: Faire un don
nl: Doneren
th: บริจาค

source: Get FPC for ESP32 [lx6] boards
de: FPC für ESP32 [lx6] Boards abrufen
fr: Obtenir FPC pour les cartes ESP32 [lx6]
nl: FPC ophalen voor ESP32 [lx6] borden
th: รับ FPC สำหรับบอร์ด ESP32 [lx6]

source: If cross-compiler present, build the native compiler for selected system in cross.
fr: Si le compilateur croisé est présent, compiler le compilateur natif pour le système sélectionné en croisé.

source: Fixes
fr: Correctifs

source: Will install/update current fixes versions of both FPC and Lazarus
de: Installiert/aktualisiert die aktuellen Fixes-Versionen von FPC und Lazarus
fr: Installera/mettra à jour les versions actuelles corrigées de FPC et Lazarus
nl: Zal de huidige fixes-versies van zowel FPC als Lazarus installeren/bijwerken
th: จะติดตั้ง/อัปเดตเวอร์ชัน fixes ปัจจุบันของทั้ง FPC และ Lazarus

source: FPC revision history
de: FPC Revisionshistorie
fr: Historique des révisions de FPC
nl: FPC revisie-geschiedenis
th: ประวัติรุ่น FPC

# tform1.fpctaglabel.caption
source: FPC version
fr: Version FPC
nl: FPC-versie
th: เวอร์ชัน FPC

# tform1.fpcversionlabel.caption
source: FPC version
fr: Version FPC
nl: FPC-versie
th: เวอร์ชัน FPC

source: History
de: Verlauf
fr: Historique
nl: Geschiedenis
th: ประวัติ

source: Directory to install FPC and Lazarus
de: Verzeichnis für die FPC- und Lazarus-Installation
fr: Répertoire pour installer FPC et Lazarus
nl: Map voor installatie van FPC en Lazarus
th: ไดเรกทอรีสำหรับติดตั้ง FPC และ Lazarus

source: Lazarus revision history
de: Lazarus Revisionshistorie
fr: Historique des révisions de Lazarus
nl: Lazarus revisie-geschiedenis
th: ประวัติรุ่น Lazarus

# tform1.lazarustaglabel.caption
source: Lazarus version
fr: Version Lazarus
nl: Lazarus-versie
th: เวอร์ชัน Lazarus

# tform1.lazarusversionlabel.caption
source: Lazarus version
fr: Version Lazarus
nl: Lazarus-versie
th: เวอร์ชัน Lazarus

# tform1.listboxfpchistorynew.columns[0].caption
source: Hash
fr: Hachage

# tform1.listboxfpchistorynew.columns[1].caption
source: Rev-name
fr: Nom de révision
nl: Rev-naam
th: ชื่อรุ่น

# tform1.listboxlazarushistorynew.columns[0].caption
source: Hash
fr: Hachage

# tform1.listboxlazarushistorynew.columns[1].caption
source: Rev-name
fr: Nom de révision
nl: Rev-naam
th: ชื่อรุ่น

source: About Up
de: Über Up
fr: À propos de Up
nl: Over Up
th: เกี่ยวกับโปรแกรม

source: Chinese (CN)
de: Chinesisch (CN)
fr: Chinois (CN)
nl: Chinees (CN)
th: จีน (CN)

source: Dutch (NL)
de: Niederländisch (NL)
fr: Néerlandais (NL)
nl: Nederlands (NL)
th: ดัตช์ (NL)

source: Will show info and error
de: Zeigt Infos und Fehler an
fr: Afichera les infos et les erreurs
nl: Toont info en fouten
th: จะแสดงข้อมูลและข้อผิดพลาด

source: English (EN)
de: Englisch (EN)
fr: Anglais (EN)
nl: Engels (EN)
th: อังกฤษ (EN)

source: &File
de: &Datei
fr: &Fichier
nl: &Bestand
th: &ไฟล์

source: Languages
de: Sprachen
fr: Langues
nl: Talen
th: ภาษา

source: Issues
de: Probleme
fr: Problèmes
th: ปัญหา (Issues)

source: FPC bugs
de: FPC-Fehler
fr: Bogues de FPC
th: บั๊ก FPC

source: French (F)
de: Französisch (F)
fr: Français (F)
nl: Frans (F)
th: ฝรั่งเศส (F)

source: German (D)
de: Deutsch (D)
fr: Allemand (D)
nl: Duits (D)
th: เยอรมัน (D)

source: Help
de: Hilfe
fr: Aide
th: ช่วยเหลือ

source: Up Lazarus forum
fr: Forum Lazarus Up
nl: Naar Lazarus forum
th: ไปที่ฟอรัม Lazarus

source: Up GitHub issues
de: Up GitHub Probleme
fr: Problèmes GitHub Up
nl: Naar GitHub issues
th: ไปที่ปัญหาใน GitHub

source: Korean (KR)
de: Koreanisch (KR)
fr: Coréen (KR)
nl: Koreaans (KR)
th: เกาหลี (KR)

source: Lazarus bugs
de: Lazarus-Fehler
fr: Bogues de Lazarus
th: บั๊ก Lazarus

source: Online docs
de: Online-Dokumentation
fr: Documentation en ligne
nl: Online documentatie
th: เอกสารออนไลน์

source: Get the mORMot2 for FPC
de: mORMot2 für FPC abrufen
fr: Obtenir le mORMot2 pour FPC
nl: Haal mORMot2 op voor FPC
th: รับ mORMot2 สำหรับ FPC

source: Portuguese (PT)
de: Portugiesisch (PT)
fr: Portugais (PT)
nl: Portugees (PT)
th: โปรตุเกส (PT)

source: Russian (RUS)
de: Russisch (RUS)
fr: Russe (RUS)
nl: Russisch (RUS)
th: รัสเซีย (RUS)

source: Thai (TH)
fr: Thaï (TH)

source: Turkish (TR)
de: Türkisch (TR)
fr: Turc (TR)
nl: Turks (TR)
th: ตุรกี (TR)

source: Ukrainian (UK)
de: Ukrainisch (UK)
fr: Ukrainien (UK)
nl: Oekraïens (UK)
th: ยูเครน (UK)

source: Online Wiki
fr: Wiki en ligne
th: วิกิออนไลน์

source: Will install/update the Online Package Manager
de: Installiert/aktualisiert den Online Package Manager
fr: Installera/mettra à jour le Online Package Manager
nl: Zal de Online Package Manager installeren/bijwerken
th: จะติดตั้ง/อัปเดต Online Package Manager

source: Get FPC for armv6m RPi Pico
de: FPC für armv6m RPi Pico abrufen
fr: Obtenir FPC pour armv6m RPi Pico
nl: Haal FPC op voor armv6m RPi Pico
th: รับ FPC สำหรับ armv6m RPi Pico

# tform1.realfpcurl.hint
source: Double click to allow editing
de: Doppelklick zum Bearbeiten
fr: Doubler-cliquer pour autoriser la modification
nl: Dubbelklik om bewerken toe te staan
th: ดับเบิลคลิกเพื่อแก้ไข

# tform1.reallazurl.hint
source: Double click to allow editing
de: Doppelklick zum Bearbeiten
fr: Doubler-cliquer pour autoriser la modification
nl: Dubbelklik om bewerken toe te staan
th: ดับเบิลคลิกเพื่อแก้ไข

source: Will install/update stable versions of both FPC and Lazarus
de: Installiert/aktualisiert stabile Versionen von FPC und Lazarus
fr: Installera/mettra à jour les versions stables de FPC et Lazarus
nl: Zal stabiele versies van zowel FPC als Lazarus installeren/bijwerken
th: จะติดตั้ง/อัปเดตเวอร์ชันเสถียรของทั้ง FPC และ Lazarus

source: Sitting and waiting
de: Untätig und wartend
fr: S'asseoir et attendre
nl: Bezig met wachten
th: กำลังรอการดำเนินการ

source: Will install/update trunk version of both FPC and Lazarus.
de: Installiert/aktualisiert die Trunk-Version von FPC und Lazarus.
fr: Installera/mettra à jour la version trunk de FPC et Lazarus.
nl: Zal de trunk-versie van zowel FPC als Lazarus installeren/bijwerken.
th: จะติดตั้ง/อัปเดตเวอร์ชัน trunk ของทั้ง FPC และ Lazarus

source: Install baremetal Ultibo for RPi2/3/4/5
de: Bare-Metal Ultibo für RPi2/3/4/5 installieren
fr: Installer Ultibo baremetal pour RPi2/3/4/5
nl: Installeer baremetal Ultibo voor RPi2/3/4/5
th: ติดตั้ง Ultibo (Bare metal) สำหรับ RPi2/3/4/5

source: Install FPC and Lazarus for Web Assembly
de: FPC und Lazarus für Web Assembly installieren
fr: Installer FPC et Lazarus pour l'assemblage Web
nl: Installeer FPC en Lazarus voor Web Assembly
th: ติดตั้ง FPC และ Lazarus สำหรับ Web Assembly

source: Get FPC for SAMD51 embedded on Wio Terminal
de: FPC für eingebetteten SAMD51 auf Wio Terminal abrufen
fr: Obtenir FPC pour SAMD51 embarqué sur le terminal Wio
nl: Haal FPC op voor SAMD51 embedded op Wio Terminal
th: รับ FPC สำหรับ SAMD51 ที่ฝังบน Wio Terminal

# tsettingsform.btnaddfpcpatch.caption
source: Add FPC patch
de: FPC-Patch hinzufügen
fr: Ajouter un correctif FPC
nl: FPC patch toevoegen
th: เพิ่มแพตช์ FPC

# tsettingsform.btnaddlazpatch.caption
source: Add Laz. patch
de: Laz.-Patch hinzufügen
fr: Ajouter un correctif Laz.
nl: Laz. patch toevoegen
th: เพิ่มแพตช์ Laz.

# tsettingsform.btnlistcustomoptions.caption
source: List All
de: Alle auflisten
fr: Tout lister
nl: Lijst alles
th: แสดงทั้งหมด

# tsettingsform.btnremfpcpatch.caption
source: Rem. FPC patch
de: FPC-Patch entf.
fr: Retirer un correctif FPC
nl: Verw. FPC patch
th: ลบแพตช์ FPC

# tsettingsform.btnremlazpatch.caption
source: Rem. Laz. patch
de: Laz.-Patch entf.
fr: Retirer un correctif Laz.
nl: Verw. Laz. patch
th: ลบแพตช์ Laz.

# tsettingsform.btnselectbindir.caption
source: Tools
de: Werkzeuge
fr: Outils
th: เครื่องมือ

# tsettingsform.btnselectcompiler.caption
source: Compiler
fr: Compilateur

# tsettingsform.btnselectlibdir.caption
source: Libraries
de: Bibliotheken
fr: Bibliothèques
th: ไลบรารี

# tsettingsform.caption
source: Advanced Settings
de: Erweiterte Einstellungen
fr: Paramètres avancés
nl: Geavanceerde instellingen
th: การตั้งค่าขั้นสูง

# tsettingsform.chkfpcdebug.caption
source: Debug
fr: Déboguer
th: ดีบั๊ก (Debug)

# tsettingsform.chklazarusdebug.caption
source: Debug
fr: Déboguer
th: ดีบั๊ก (Debug)

# tsettingsform.editbinlocation.hint
source: Double click to clear
de: Doppelklick zum Löschen
fr: Double-cliquer pour effacer
nl: Dubbelklik om te wissen
th: ดับเบิลคลิกเพื่อล้างข้อมูล

# tsettingsform.editcompileroverride.hint
source: Double click to clear
de: Doppelklick zum Löschen
fr: Double-cliquer pour effacer
nl: Dubbelklik om te wissen
th: ดับเบิลคลิกเพื่อล้างข้อมูล

# tsettingsform.editliblocation.hint
source: Double click to clear
de: Doppelklick zum Löschen
fr: Double-cliquer pour effacer
nl: Dubbelklik om te wissen
th: ดับเบิลคลิกเพื่อล้างข้อมูล

# tsettingsform.groupbox1.caption
source: Proxy settings
de: Proxy-Einstellungen
fr: Paramètres du proxy
nl: Proxy-instellingen
th: ตั้งค่า Proxy

# tsettingsform.groupbox2.caption
source: Miscellaneous settings
de: Verschiedene Einstellungen
fr: Paramètres divers
nl: Diverse instellingen
th: การตั้งค่าอื่น ๆ

# tsettingsform.groupboxcompileoptions.caption
source: Options Override
de: Optionen überschreiben
fr: Remplacement des options
nl: Opties overschrijven
th: บังคับเปลี่ยนตัวเลือก (Options Override)

# tsettingsform.groupboxfpclazbranchrevision.caption
source: Branch and revision
de: Zweig und Revision
fr: Branche et révision
nl: Branch en revisie
th: Branch และ Revision

# tsettingsform.groupboxfpclazscripts.caption
source: Pre and post install scripts
de: Skripte vor/nach der Installation
fr: Scripts avant et après installation
nl: Pre- en post-installatie scripts
th: สคริปต์ก่อนและหลังการติดตั้ง

# tsettingsform.grppatching.caption
source: Source patching
de: Quellcode-Patching
fr: Correction de la source
nl: Bronbestanden patchen
th: การแพตช์ซอร์ส

# tsettingsform.label1.caption
source: HTTP proxy URL:
fr: URL du proxy HTTP :

# tsettingsform.label2.caption
source: HTTP proxy port:
fr: Port du proxy HTTP :
nl: HTTP proxy poort:

# tsettingsform.label3.caption
source: HTTP proxy username:
de: HTTP-Proxy Benutzername:
fr: Utilisateur du proxy HTTP :
nl: HTTP proxy gebruikersnaam:
th: ชื่อผู้ใช้ HTTP proxy:

# tsettingsform.label4.caption
source: HTTP proxy password:
de: HTTP-Proxy Passwort:
fr: Mot de passe du proxy HTTP :
nl: HTTP proxy wachtwoord:
th: รหัสผ่าน HTTP proxy:

# tsettingsform.labelcompileroverride.caption
source: Compiler Override
de: Compiler überschreiben
fr: Remplacement du compilateur
nl: Compiler overschrijven
th: บังคับเปลี่ยน Compiler

# tsettingsform.labelcpu.caption
source: Select CPU
de: CPU wählen
fr: Sélectionner un CPU
nl: Selecteer CPU
th: เลือก CPU

# tsettingsform.labelcrossbuildoptions.caption
source: Cross Build Options Override (i.e. -CfSoft)
de: Cross-Build Optionen überschreiben (z.B. -CfSoft)
fr: Remplacement des options de compilation croisée (-CfSoft)
nl: Cross Build Opties Overschrijven (bijv. -CfSoft)
th: บังคับเปลี่ยนตัวเลือกการสร้าง Cross (เช่น -CfSoft)

# tsettingsform.labelfpcbranch.caption
source: FPC branch/tag
de: FPC Zweig/Tag
fr: Branche/tag FPC

# tsettingsform.labelfpcoptions.caption
source: FPC options
de: FPC-Optionen
fr: Options FPC
nl: FPC opties
th: ตัวเลือก FPC

# tsettingsform.labelfpcpostinstall.caption
source: FPC post
de: FPC nach
fr: FPC après
th: FPC หลังติดตั้ง

# tsettingsform.labelfpcpreinstall.caption
source: FPC pre
de: FPC vor
fr: FPC avant
th: FPC ก่อนติดตั้ง

# tsettingsform.labelfpcrevision.caption
source: FPC hash
fr: Hachage FPC

# tsettingsform.labellazarusbranch.caption
source: Laz. branch/tag
de: Laz. Zweig/Tag
fr: Branche/tag Laz.

# tsettingsform.labellazarusoptions.caption
source: Laz. options
de: Laz.-Optionen
fr: Options Laz.
nl: Laz. opties
th: ตัวเลือก Laz.

# tsettingsform.labellazaruspostinstall.caption
source: Lazarus post
de: Lazarus nach
fr: Lazarus après
th: Lazarus หลังติดตั้ง

# tsettingsform.labellazaruspreinstall.caption
source: Lazarus pre
de: Lazarus vor
fr: Lazarus avant
th: Lazarus ก่อนติดตั้ง

# tsettingsform.labellazarusrevision.caption
source: Laz. hash
fr: Hachage Laz.

# tsettingsform.labelos.caption
source: Select OS
de: OS wählen
fr: Sélectionner l'OS
nl: Selecteer OS
th: เลือก OS

# tsettingsform.radiogrouparmarch.caption
source: ARM target
de: ARM-Ziel
fr: Cible ARM
nl: ARM-doel
th: เป้าหมาย ARM

# tsettingsform.rgrpsearchoptions.caption
source: Search options
de: Suchoptionen
fr: Options de recherche
nl: Zoekopties
th: ตัวเลือกการค้นหา

# tsettingsform.rgrpsubarch.caption
source: Select subarch
de: Sub-Architektur wählen
fr: Sélectionner la sous-architecture
nl: Selecteer subarch
th: เลือก Subarch

# tsettingsform.tssubarch.caption
source: Subarch
fr: Sous-arch
